app/CentralLogics/Helpers.php

select `key`, `value` from `business_settings`
---
        public static function get_business_settings($key, $json_decode = true,$relations = [])
        {
            try {
                static $allSettings = null;

            $configKey = $key . '_conf';
            if (Config::has($configKey)) {
                $data = Config::get($configKey);
            } else {
                if (is_null($allSettings)) {
                    $allSettings = Cache::rememberForever('business_settings_all_data', function () {
                        return BusinessSetting::select('key', 'value')->get();
                    });

select * from `business_settings` where `key` = 'subscription_business_model' limit 1
---
    public static function insert_business_settings_key($key, $value = null)
    {
        $data = BusinessSetting::where('key', $key)->first();

select * from `business_settings` where `key` = 'icon' limit 1
---
    public static function getSettingsDataFromConfig($settings, $relations = [])
    {
        try {
            if (!config($settings . '_conf')) {
                $data = BusinessSetting::where('key', $settings)->with($relations)->first();