app/Http/Controllers/DeliveryManController.php

select * from `business_settings` where `key` = 'toggle_dm_registration' limit 1
---
    public function create()
    {
        $status = BusinessSetting::where('key', 'toggle_dm_registration')->first();